#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.UpdateVisibility
	 */
	struct UBotBlackActionBar_C_UpdateVisibility_Params
	{
	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_Divider5_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_Divider5_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_Divider4_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_Divider4_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_Divider3_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_Divider3_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_Divider2_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_Divider2_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_Divider1_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_Divider1_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_LDivider5_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_LDivider5_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_LDivider4_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_LDivider4_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_LDivider3_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_LDivider3_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_LDivider2_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_LDivider2_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Get_LDivider1_Visibility_1
	 */
	struct UBotBlackActionBar_C_Get_LDivider1_Visibility_1_Params
	{
	public:
		UMG_ESlateVisibility                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.IsEmpty
	 */
	struct UBotBlackActionBar_C_IsEmpty_Params
	{
	public:
		class UNamedSlot*                                          NamedSlot;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.Construct
	 */
	struct UBotBlackActionBar_C_Construct_Params
	{
	};

	/**
	 * Function BotBlackActionBar.BotBlackActionBar_C.ExecuteUbergraph_BotBlackActionBar
	 */
	struct UBotBlackActionBar_C_ExecuteUbergraph_BotBlackActionBar_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
