#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction BPA_BaseChar.BPA_BaseChar_C.OnCustomized_animBP__DelegateSignature
	 */
	struct UBPA_BaseChar_C_OnCustomized_animBP__DelegateSignature_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.UpdateSiegeState
	 */
	struct UBPA_BaseChar_C_UpdateSiegeState_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.UpdateMovementState
	 */
	struct UBPA_BaseChar_C_UpdateMovementState_Params
	{
	public:
		class FName                                                bpp__MovementState__pf;                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.updateMorphWhenChange
	 */
	struct UBPA_BaseChar_C_updateMorphWhenChange_Params
	{
	public:
		float                                                      bpp__Value__pf;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                bpp__MorphTargetName__pf;                                // 0x0004(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.UpdateCombatState
	 */
	struct UBPA_BaseChar_C_UpdateCombatState_Params
	{
	public:
		class FName                                                bpp__combatState__pf;                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAttackInfo                                         bpp__AttackxInfo__pfT;                                   // 0x0008(0x0108)  (Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.UpdateBranchEnums
	 */
	struct UBPA_BaseChar_C_UpdateBranchEnums_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.update_isSimulateCloth
	 */
	struct UBPA_BaseChar_C_update_isSimulateCloth_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.StopMovementMontage
	 */
	struct UBPA_BaseChar_C_StopMovementMontage_Params
	{
	public:
		class UNativeAnimationSet_Base*                            bpp__AnimationSet__pf;                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.SetSprintMovementState
	 */
	struct UBPA_BaseChar_C_SetSprintMovementState_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.SetIsRecoveryToHolding
	 */
	struct UBPA_BaseChar_C_SetIsRecoveryToHolding_Params
	{
	public:
		bool                                                       bpp__isRecoveryToHolding__pf;                            // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.SetIsLeaveCombatState
	 */
	struct UBPA_BaseChar_C_SetIsLeaveCombatState_Params
	{
	public:
		bool                                                       bpp__IsLeaveCombatState__pf;                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.setHandIK
	 */
	struct UBPA_BaseChar_C_setHandIK_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.setFootIK
	 */
	struct UBPA_BaseChar_C_setFootIK_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.resetTurnTick
	 */
	struct UBPA_BaseChar_C_resetTurnTick_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.QueuePoseSnapshot
	 */
	struct UBPA_BaseChar_C_QueuePoseSnapshot_Params
	{
	public:
		class FName                                                bpp__PoseName__pf;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.playMovementMontage
	 */
	struct UBPA_BaseChar_C_playMovementMontage_Params
	{
	public:
		class UAnimMontage*                                        bpp__Montage__pf__const;                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                bpp__SectionName__pf;                                    // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.playCombatMontage
	 */
	struct UBPA_BaseChar_C_playCombatMontage_Params
	{
	public:
		class UAnimMontage*                                        bpp__AnimMontage__pf;                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                bpp__SectionName__pf;                                    // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bpp__isMultiTrigger__pf;                                 // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.onKnockoffHelemt
	 */
	struct UBPA_BaseChar_C_onKnockoffHelemt_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.OnCustomized_animBP
	 */
	struct UBPA_BaseChar_C_OnCustomized_animBP_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.leftArmCtrl
	 */
	struct UBPA_BaseChar_C_leftArmCtrl_Params
	{
	public:
		bool                                                       bpp__isCheapTick__pf;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.IsPlayingLadderMontage
	 */
	struct UBPA_BaseChar_C_IsPlayingLadderMontage_Params
	{
	public:
		bool                                                       bpp__IsPlayingMontage__pf;                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.InitialValue
	 */
	struct UBPA_BaseChar_C_InitialValue_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.GetDamageTypeName
	 */
	struct UBPA_BaseChar_C_GetDamageTypeName_Params
	{
	public:
		class UDamageSource*                                       bpp__DamageType__pf;                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              bpp__NameString__pf;                                     // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.getAimYawSpeed
	 */
	struct UBPA_BaseChar_C_getAimYawSpeed_Params
	{
	public:
		float                                                      bpp__AimYaw__pf;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      bpp__PreAimYaw__pf;                                      // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      bpp__AimYawSpeed__pf;                                    // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      bpp__AimYawAbs__pf;                                      // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.flipYawDirection
	 */
	struct UBPA_BaseChar_C_flipYawDirection_Params
	{
	public:
		float                                                      bpp__inputYaw__pf;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      bpp__outputYaw__pf;                                      // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_10
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_10_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_9
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_9_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_7
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_7_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_58
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_58_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_6
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_6_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_5
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_5_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_36
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_36_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_34
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_34_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_33
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_33_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_26
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_26_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_24
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_24_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_23
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_23_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_21
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_21_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_20
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_20_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_19
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_19_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_161
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_161_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_144
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_144_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_132
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_132_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_128
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_128_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_124
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_124_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_13
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_13_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_114
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_114_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_113
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_113_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.ExecuteUbergraph_BPA_BaseChar_110
	 */
	struct UBPA_BaseChar_C_ExecuteUbergraph_BPA_BaseChar_110_Params
	{
	public:
		int                                                        bpp__EntryPoint__pf;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventVOPlaying
	 */
	struct UBPA_BaseChar_C_EventVOPlaying_Params
	{
	public:
		bool                                                       bpp__IsPlaying__pf;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventUnfreezeRagdollPhysics
	 */
	struct UBPA_BaseChar_C_EventUnfreezeRagdollPhysics_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventSpawnMontageStart
	 */
	struct UBPA_BaseChar_C_EventSpawnMontageStart_Params
	{
	public:
		class FName                                                bpp__AnimationName__pf__const;                           // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventSpawnMontageComplete
	 */
	struct UBPA_BaseChar_C_EventSpawnMontageComplete_Params
	{
	public:
		class FName                                                bpp__AnimationName__pf__const;                           // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnWantsToGallop
	 */
	struct UBPA_BaseChar_C_EventOnWantsToGallop_Params
	{
	public:
		bool                                                       bpp__bWantsToGallop__pf;                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnStrafeStop
	 */
	struct UBPA_BaseChar_C_EventOnStrafeStop_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnSprintStop
	 */
	struct UBPA_BaseChar_C_EventOnSprintStop_Params
	{
	public:
		bool                                                       bpp__bIsHoldingMoveKey__pf;                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnSprintStart
	 */
	struct UBPA_BaseChar_C_EventOnSprintStart_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnSignificanceChanged
	 */
	struct UBPA_BaseChar_C_EventOnSignificanceChanged_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnSiegeMounted
	 */
	struct UBPA_BaseChar_C_EventOnSiegeMounted_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnSiegeDismounted
	 */
	struct UBPA_BaseChar_C_EventOnSiegeDismounted_Params
	{
	public:
		TBL_EDismountType                                          bpp__DismountType__pf;                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnMovementStateChanged
	 */
	struct UBPA_BaseChar_C_EventOnMovementStateChanged_Params
	{
	public:
		class FName                                                bpp__InMovementState__pf;                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                bpp__InPreviousMovementState__pf;                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnMovementDirectionChanged
	 */
	struct UBPA_BaseChar_C_EventOnMovementDirectionChanged_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnMovementActionStarted
	 */
	struct UBPA_BaseChar_C_EventOnMovementActionStarted_Params
	{
	public:
		class FName                                                bpp__MovementName__pf;                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                                            bpp__Direction__pf;                                      // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnMissingLimb
	 */
	struct UBPA_BaseChar_C_EventOnMissingLimb_Params
	{
	public:
		class FName                                                bpp__Condition__pf;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnLODLevelChanged
	 */
	struct UBPA_BaseChar_C_EventOnLODLevelChanged_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnLanded
	 */
	struct UBPA_BaseChar_C_EventOnLanded_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnKilled
	 */
	struct UBPA_BaseChar_C_EventOnKilled_Params
	{
	public:
		struct FAnimDeathParams                                    bpp__Params__pf__const;                                  // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnInterrupt
	 */
	struct UBPA_BaseChar_C_EventOnInterrupt_Params
	{
	public:
		struct FAnimDamageParams                                   bpp__DamageEvent__pf__const;                             // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnHorseStartMount
	 */
	struct UBPA_BaseChar_C_EventOnHorseStartMount_Params
	{
	public:
		class FName                                                bpp__Direction__pf;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnHorseStartDismount
	 */
	struct UBPA_BaseChar_C_EventOnHorseStartDismount_Params
	{
	public:
		class FName                                                bpp__Direction__pf;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnHorseMounted
	 */
	struct UBPA_BaseChar_C_EventOnHorseMounted_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnHorseDismounted
	 */
	struct UBPA_BaseChar_C_EventOnHorseDismounted_Params
	{
	public:
		TBL_EDismountType                                          bpp__DismountType__pf;                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnHitAfterDeath
	 */
	struct UBPA_BaseChar_C_EventOnHitAfterDeath_Params
	{
	public:
		struct FAnimDeathParams                                    bpp__Params__pf__const;                                  // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnDashCooldownFinished
	 */
	struct UBPA_BaseChar_C_EventOnDashCooldownFinished_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnDash
	 */
	struct UBPA_BaseChar_C_EventOnDash_Params
	{
	public:
		float                                                      bpp__InDashDirection__pf;                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnCombatStateEnd
	 */
	struct UBPA_BaseChar_C_EventOnCombatStateEnd_Params
	{
	public:
		class AActor*                                              bpp__Actor__pf;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                bpp__State__pf;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAttackInfo                                         bpp__EventAttackInfo__pf__const;                         // 0x0010(0x0108)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
		class UCombatState*                                        bpp__InCombatState__pf;                                  // 0x0118(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnCombatStateBegin
	 */
	struct UBPA_BaseChar_C_EventOnCombatStateBegin_Params
	{
	public:
		class AActor*                                              bpp__Actor__pf;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                bpp__State__pf;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAttackInfo                                         bpp__EventAttackInfo__pf__const;                         // 0x0010(0x0108)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
		class UCombatState*                                        bpp__InCombatState__pf;                                  // 0x0118(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnCameraOffsetEnd
	 */
	struct UBPA_BaseChar_C_EventOnCameraOffsetEnd_Params
	{
	public:
		float                                                      bpp__AngleOffset__pf;                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventOnCameraOffsetBegin
	 */
	struct UBPA_BaseChar_C_EventOnCameraOffsetBegin_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventHiddenPositionUpdate
	 */
	struct UBPA_BaseChar_C_EventHiddenPositionUpdate_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventFreezeRagdollPhysics
	 */
	struct UBPA_BaseChar_C_EventFreezeRagdollPhysics_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventFarFromCameraChanged
	 */
	struct UBPA_BaseChar_C_EventFarFromCameraChanged_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventDamageNoInterrupt
	 */
	struct UBPA_BaseChar_C_EventDamageNoInterrupt_Params
	{
	public:
		struct FAnimDamageParams                                   bpp__DamageEvent__pf__const;                             // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EventCarryableCharacter
	 */
	struct UBPA_BaseChar_C_EventCarryableCharacter_Params
	{
	public:
		class FName                                                bpp__EventName__pf;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ATBLCharacter*                                       bpp__ParentCharacter__pf;                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_FFF7CA35497C4A3B1AF41B8A0CD6CA3F
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_FFF7CA35497C4A3B1AF41B8A0CD6CA3F_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_F70FC43D49AF80BBD95EDE90B98ABB07
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_F70FC43D49AF80BBD95EDE90B98ABB07_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_F44E788B45E3141B78B9DEBF78613246
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_F44E788B45E3141B78B9DEBF78613246_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_E6581173432661F17B43D3A3393B0AD6
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_E6581173432661F17B43D3A3393B0AD6_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_DA1E81654980B42A191638952FA5606D
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_DA1E81654980B42A191638952FA5606D_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_D8BAB93E44EFBF75E4EA308EEB768CF7
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_D8BAB93E44EFBF75E4EA308EEB768CF7_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_D326501B455BCAFABC93799514D531A5
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_D326501B455BCAFABC93799514D531A5_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_C8EE48A44EF0F95FDCC8FFB6D794AF36
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_C8EE48A44EF0F95FDCC8FFB6D794AF36_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_C332471E411D9F2FD5E1AC9F99C94E33
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_C332471E411D9F2FD5E1AC9F99C94E33_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_BE5959D041CAD2AE64774DB8D777F45A
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_BE5959D041CAD2AE64774DB8D777F45A_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_B2814A074A009058C37014B2E4BBE572
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_B2814A074A009058C37014B2E4BBE572_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_9CFE86DF48D07817526BF4993E752B41
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_9CFE86DF48D07817526BF4993E752B41_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_9928E2474EA70E9632F1B185301FD875
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_9928E2474EA70E9632F1B185301FD875_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_83BF4EAB4073143A93CFF5A218CFD17C
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_83BF4EAB4073143A93CFF5A218CFD17C_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_7CE1406E48D05F54554D5CB0F8F6E9F6
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_7CE1406E48D05F54554D5CB0F8F6E9F6_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_78C93B624FAFA049D13D9198D9B04E75
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_78C93B624FAFA049D13D9198D9B04E75_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_73485F074A84BA51673105A728947533
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_73485F074A84BA51673105A728947533_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_6594B689495DB961F73024AC3701368F
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_6594B689495DB961F73024AC3701368F_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_63D7E9DF4D6072456D589891DEEFDDD4
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_63D7E9DF4D6072456D589891DEEFDDD4_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_61A2477D41EE72A811F9CBAD06B08190
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_61A2477D41EE72A811F9CBAD06B08190_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_5652BD174DFB4247DDC63EB052E62CED
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_5652BD174DFB4247DDC63EB052E62CED_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_561FE81942D40D92BFFA698DC4F54D06
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_561FE81942D40D92BFFA698DC4F54D06_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_408C45D84F7A7084D63D3B9A10FF1F39
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_408C45D84F7A7084D63D3B9A10FF1F39_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_3DABA2A94AEE3597BB6392961252BF04
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_3DABA2A94AEE3597BB6392961252BF04_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_34E6655B4B8AEA072229C48FB746FE27
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_34E6655B4B8AEA072229C48FB746FE27_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_2400B0DC452385A247D65286886E5A74
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_2400B0DC452385A247D65286886E5A74_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_1477B96B40C99DF16C200DADC6BEA557
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_1477B96B40C99DF16C200DADC6BEA557_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_1337FC464F69F4C228736989E6D81871
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_1337FC464F69F4C228736989E6D81871_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_0E3A3C5F4D8126BCD87178BA7504B145
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_0E3A3C5F4D8126BCD87178BA7504B145_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_09C022D746FE94B5A5FA3AA985744AFA
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_09C022D746FE94B5A5FA3AA985744AFA_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_095B47CA46C0413DA73CCA874070C551
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_095B47CA46C0413DA73CCA874070C551_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_0412B47B439ABA7C065D4DB8DF05EA94
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_0412B47B439ABA7C065D4DB8DF05EA94_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_01C77901492F8E84852892AE795005E2
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoWayBlend_01C77901492F8E84852892AE795005E2_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_F33C66E54B60753759DBD08867B3BBB6
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_F33C66E54B60753759DBD08867B3BBB6_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_BDE69C69475B4713A5783BB11F93ED05
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_BDE69C69475B4713A5783BB11F93ED05_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_775ED5C54E3EC6CA2A8DE795E17C4EE1
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_775ED5C54E3EC6CA2A8DE795E17C4EE1_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_47B82E174BF9BF34118808AB59093889
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_47B82E174BF9BF34118808AB59093889_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_2B8829414D1FCD01F18B89AAE3D05713
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_2B8829414D1FCD01F18B89AAE3D05713_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_200B82E64C4EA16B76019096F9482E29
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TwoBoneIK_200B82E64C4EA16B76019096F9482E29_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_FF7D49244168BA780D6B4F829B3807B1
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_FF7D49244168BA780D6B4F829B3807B1_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_F405F51E47929582A6152FAA50ED4FE6
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_F405F51E47929582A6152FAA50ED4FE6_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_EA4D50214E35BA944B3D73B6D390F5D7
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_EA4D50214E35BA944B3D73B6D390F5D7_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_E657A69E4493D64D3BE4B0A856EA35DC
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_E657A69E4493D64D3BE4B0A856EA35DC_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_E1CE0F7D44214FC66152B9840399F2D6
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_E1CE0F7D44214FC66152B9840399F2D6_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_CD9B220F47431DF78643B698AC1F3C0A
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_CD9B220F47431DF78643B698AC1F3C0A_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_CB500FD94D25774D6323A5A2768894A0
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_CB500FD94D25774D6323A5A2768894A0_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C85F93824BDCE37B8E4779BE7251F504
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C85F93824BDCE37B8E4779BE7251F504_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C593984847ED7A2EE497ACA80F0AC5F3
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C593984847ED7A2EE497ACA80F0AC5F3_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C0F2A805492E884834FC8B882759A71D
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C0F2A805492E884834FC8B882759A71D_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C04A1FD34D4B72B9BA258E83BF6D9722
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_C04A1FD34D4B72B9BA258E83BF6D9722_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_B4B3625641F3A47C8C9FEF91AF3F5B43
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_B4B3625641F3A47C8C9FEF91AF3F5B43_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_B44F843A443390F5CDE68693D99CA9F7
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_B44F843A443390F5CDE68693D99CA9F7_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_ADE1147447740A5E1504308C4814DCF4
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_ADE1147447740A5E1504308C4814DCF4_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_AC9BD4524053777C193847874EF944ED
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_AC9BD4524053777C193847874EF944ED_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_A8636A9447A6871EB0AE10A96E32EDDA
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_A8636A9447A6871EB0AE10A96E32EDDA_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_A758369142F90DE2F19C3D9F199FEFA5
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_A758369142F90DE2F19C3D9F199FEFA5_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_A492D1E2499C6062E947D6B8890BBDF9
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_A492D1E2499C6062E947D6B8890BBDF9_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_9FC6600B48E425511E48588D5E5FD1B5
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_9FC6600B48E425511E48588D5E5FD1B5_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_964C6D194DEC6FEE18662DA8B201460A
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_964C6D194DEC6FEE18662DA8B201460A_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_9568777C4437ED2976576B84332EB9FF
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_9568777C4437ED2976576B84332EB9FF_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8BD51E2C40AFB97AEDC81EB530E8E632
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8BD51E2C40AFB97AEDC81EB530E8E632_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8B52AB0944C24C223BD10FB9A4B9FA51
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8B52AB0944C24C223BD10FB9A4B9FA51_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_88E36D4448739412B379E1B029573DD7
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_88E36D4448739412B379E1B029573DD7_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_88A0A0994DD6793E21BCD1959C8B39D9
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_88A0A0994DD6793E21BCD1959C8B39D9_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8355B44B4B07A44EF691439B4D5B5D5C
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8355B44B4B07A44EF691439B4D5B5D5C_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_82FB11AA4F9ADF04F946A384F76C1B19
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_82FB11AA4F9ADF04F946A384F76C1B19_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8268E56B4B55F34526B9219A4F42385D
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_8268E56B4B55F34526B9219A4F42385D_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_7E00595142AED12E421A9B9610F81765
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_7E00595142AED12E421A9B9610F81765_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_7B3D40AC49168B9F036B919E6C6D855F
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_7B3D40AC49168B9F036B919E6C6D855F_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_7983B9E14C8B5A246991F5A86CAC587C
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_7983B9E14C8B5A246991F5A86CAC587C_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_797C39A54A26BB40B1F54FAA79D2D841
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_797C39A54A26BB40B1F54FAA79D2D841_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_752CC09B485C8F651E6CCDBD01329429
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_752CC09B485C8F651E6CCDBD01329429_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_738A14C14BD3CC7A612BF49990DC68FA
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_738A14C14BD3CC7A612BF49990DC68FA_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_6ACA478E45ABE867AE62B6A82C7E78C9
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_6ACA478E45ABE867AE62B6A82C7E78C9_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_6ABC4EFA4349562F251030AE09751427
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_6ABC4EFA4349562F251030AE09751427_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_69920E004413E9DC2ED962838E69BAFD
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_69920E004413E9DC2ED962838E69BAFD_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_547C39F742ADFDA1183D1BB1EDF56D26
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_547C39F742ADFDA1183D1BB1EDF56D26_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_4746196A4379480885744588A4E109BA
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_4746196A4379480885744588A4E109BA_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_44F8E7D24C7BF14E1BA3BF9482421D81
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_44F8E7D24C7BF14E1BA3BF9482421D81_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_3B6EEAC241694D2A1113E198193DAD24
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_3B6EEAC241694D2A1113E198193DAD24_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_336318274C4CD87A8373279AAD08E6FE
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_336318274C4CD87A8373279AAD08E6FE_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_321B0F7C44E533D1B1D0EFB47CE478EB
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_321B0F7C44E533D1B1D0EFB47CE478EB_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_2FF902154E797B3CBEC87D895B05EC04
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_2FF902154E797B3CBEC87D895B05EC04_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_296EBAA94DD5EDEBC30874B51B276B57
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_296EBAA94DD5EDEBC30874B51B276B57_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_28BF82CF44FA1A7ED413C1926C2031FB
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_28BF82CF44FA1A7ED413C1926C2031FB_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_2496EE864B4AAF4F7547CFB1240B9BE1
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_2496EE864B4AAF4F7547CFB1240B9BE1_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_14AE1F93432CB3F1CB7CB993AD0AFB2F
	 */
	struct UBPA_BaseChar_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_14AE1F93432CB3F1CB7CB993AD0AFB2F_Params
	{
	};

	/**
	 * Function BPA_BaseChar.BPA_BaseChar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_BaseChar_AnimGraphNode_TransitionResult_1242A8A34B6BE4779F03ABAB88ADA479
	 */
