#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.AnimGraph
	 */
	struct UBPA_Chicken_V2_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)

	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Chicken_V2_AnimGraphNode_BlendListByBool_8EE7A0484F17BF85B9433CBCF9E763FD
	 */
	struct UBPA_Chicken_V2_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Chicken_V2_AnimGraphNode_BlendListByBool_8EE7A0484F17BF85B9433CBCF9E763FD_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Chicken_V2_AnimGraphNode_BlendListByBool_23E7CF5D461428EB24ABC1A58C6EB60E
	 */
	struct UBPA_Chicken_V2_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Chicken_V2_AnimGraphNode_BlendListByBool_23E7CF5D461428EB24ABC1A58C6EB60E_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.BlueprintUpdateAnimation
	 */
	struct UBPA_Chicken_V2_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.Montage blending out
	 */
	struct UBPA_Chicken_V2_C_Montage_blending_out_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bInterrupted;                                            // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.Ragdoll
	 */
	struct UBPA_Chicken_V2_C_Ragdoll_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.CustomEvent
	 */
	struct UBPA_Chicken_V2_C_CustomEvent_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.CustomEvent_2
	 */
	struct UBPA_Chicken_V2_C_CustomEvent_2_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.BlueprintInitializeAnimation
	 */
	struct UBPA_Chicken_V2_C_BlueprintInitializeAnimation_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.Do Ragdoll
	 */
	struct UBPA_Chicken_V2_C_Do_Ragdoll_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.AnimNotify_idle_end
	 */
	struct UBPA_Chicken_V2_C_AnimNotify_idle_end_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.AnimNotify_death_ragdoll
	 */
	struct UBPA_Chicken_V2_C_AnimNotify_death_ragdoll_Params
	{
	};

	/**
	 * Function BPA_Chicken_V2.BPA_Chicken_V2_C.ExecuteUbergraph_BPA_Chicken_V2
	 */
	struct UBPA_Chicken_V2_C_ExecuteUbergraph_BPA_Chicken_V2_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
