#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BPA_Weapon.BPA_Weapon_C.AnimGraph
	 */
	struct UBPA_Weapon_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnNotifyEnd_5F65EF304857BAD353FC03AA3A48AE87
	 */
	struct UBPA_Weapon_C_OnNotifyEnd_5F65EF304857BAD353FC03AA3A48AE87_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnNotifyBegin_5F65EF304857BAD353FC03AA3A48AE87
	 */
	struct UBPA_Weapon_C_OnNotifyBegin_5F65EF304857BAD353FC03AA3A48AE87_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnInterrupted_5F65EF304857BAD353FC03AA3A48AE87
	 */
	struct UBPA_Weapon_C_OnInterrupted_5F65EF304857BAD353FC03AA3A48AE87_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnBlendOut_5F65EF304857BAD353FC03AA3A48AE87
	 */
	struct UBPA_Weapon_C_OnBlendOut_5F65EF304857BAD353FC03AA3A48AE87_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnCompleted_5F65EF304857BAD353FC03AA3A48AE87
	 */
	struct UBPA_Weapon_C_OnCompleted_5F65EF304857BAD353FC03AA3A48AE87_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnNotifyEnd_0D37C2FD43EE4809B08F48A3EF3BE365
	 */
	struct UBPA_Weapon_C_OnNotifyEnd_0D37C2FD43EE4809B08F48A3EF3BE365_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnNotifyBegin_0D37C2FD43EE4809B08F48A3EF3BE365
	 */
	struct UBPA_Weapon_C_OnNotifyBegin_0D37C2FD43EE4809B08F48A3EF3BE365_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnInterrupted_0D37C2FD43EE4809B08F48A3EF3BE365
	 */
	struct UBPA_Weapon_C_OnInterrupted_0D37C2FD43EE4809B08F48A3EF3BE365_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnBlendOut_0D37C2FD43EE4809B08F48A3EF3BE365
	 */
	struct UBPA_Weapon_C_OnBlendOut_0D37C2FD43EE4809B08F48A3EF3BE365_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.OnCompleted_0D37C2FD43EE4809B08F48A3EF3BE365
	 */
	struct UBPA_Weapon_C_OnCompleted_0D37C2FD43EE4809B08F48A3EF3BE365_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Weapon_AnimGraphNode_SequencePlayer_322C0E4248B876757229F28A45D42E2E
	 */
	struct UBPA_Weapon_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Weapon_AnimGraphNode_SequencePlayer_322C0E4248B876757229F28A45D42E2E_Params
	{
	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Weapon_AnimGraphNode_SequencePlayer_E330FA0C4EC5291710335DB6D41528ED
	 */
	struct UBPA_Weapon_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_Weapon_AnimGraphNode_SequencePlayer_E330FA0C4EC5291710335DB6D41528ED_Params
	{
	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.BlueprintUpdateAnimation
	 */
	struct UBPA_Weapon_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.BlueprintInitializeAnimation
	 */
	struct UBPA_Weapon_C_BlueprintInitializeAnimation_Params
	{
	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.EventOnCombatStateChanged
	 */
	struct UBPA_Weapon_C_EventOnCombatStateChanged_Params
	{
	public:
		class FName                                                PreviousState;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                NewState;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BPA_Weapon.BPA_Weapon_C.ExecuteUbergraph_BPA_Weapon
	 */
	struct UBPA_Weapon_C_ExecuteUbergraph_BPA_Weapon_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
