#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.GetDebugComponent
	 */
	struct Udebug_ScoredStage_C_GetDebugComponent_Params
	{
	public:
		class UBP_DebugMenuComponent_C*                            Component;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.GetText_4
	 */
	struct Udebug_ScoredStage_C_GetText_4_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.GetText_3
	 */
	struct Udebug_ScoredStage_C_GetText_3_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.GetText_2
	 */
	struct Udebug_ScoredStage_C_GetText_2_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.GetText_1
	 */
	struct Udebug_ScoredStage_C_GetText_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_209_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_ScoredStage_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_209_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.BndEvt__ForceEndByTimeoutbutton_K2Node_ComponentBoundEvent_361_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_ScoredStage_C_BndEvt__ForceEndByTimeoutbutton_K2Node_ComponentBoundEvent_361_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.BndEvt__Setscorebutton_K2Node_ComponentBoundEvent_447_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_ScoredStage_C_BndEvt__Setscorebutton_K2Node_ComponentBoundEvent_447_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.BndEvt__Button_5_K2Node_ComponentBoundEvent_532_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_ScoredStage_C_BndEvt__Button_5_K2Node_ComponentBoundEvent_532_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_ScoredStage.debug_ScoredStage_C.ExecuteUbergraph_debug_ScoredStage
	 */
	struct Udebug_ScoredStage_C_ExecuteUbergraph_debug_ScoredStage_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
