#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function debugmenu_CommandsList.debugmenu_CommandsList_C.PreConstruct
	 */
	struct Udebugmenu_CommandsList_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function debugmenu_CommandsList.debugmenu_CommandsList_C.Construct
	 */
	struct Udebugmenu_CommandsList_C_Construct_Params
	{
	};

	/**
	 * Function debugmenu_CommandsList.debugmenu_CommandsList_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_77_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebugmenu_CommandsList_C_BndEvt__Button_1_K2Node_ComponentBoundEvent_77_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debugmenu_CommandsList.debugmenu_CommandsList_C.SetCommandsButtonClicked_Event_1
	 */
	struct Udebugmenu_CommandsList_C_SetCommandsButtonClicked_Event_1_Params
	{
	public:
		class FText                                                MapListString;                                           // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

	/**
	 * Function debugmenu_CommandsList.debugmenu_CommandsList_C.CustomEvent
	 */
	struct Udebugmenu_CommandsList_C_CustomEvent_Params
	{
	public:
		class FText                                                MapListString;                                           // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

	/**
	 * Function debugmenu_CommandsList.debugmenu_CommandsList_C.ExecuteUbergraph_debugmenu_CommandsList
	 */
	struct Udebugmenu_CommandsList_C_ExecuteUbergraph_debugmenu_CommandsList_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function debugmenu_CommandsList.debugmenu_CommandsList_C.CommandListClicked__DelegateSignature
	 */
	struct Udebugmenu_CommandsList_C_CommandListClicked__DelegateSignature_Params
	{
	public:
		class FText                                                MapName;                                                 // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
