#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function debug_TimedObjectiveComponent.debug_TimedObjectiveComponent_C.Max
	 */
	struct Udebug_TimedObjectiveComponent_C_Max_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_TimedObjectiveComponent.debug_TimedObjectiveComponent_C.percent to share
	 */
	struct Udebug_TimedObjectiveComponent_C_percent_to_share_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_TimedObjectiveComponent.debug_TimedObjectiveComponent_C.Duration
	 */
	struct Udebug_TimedObjectiveComponent_C_Duration_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_TimedObjectiveComponent.debug_TimedObjectiveComponent_C.Get Time Left
	 */
	struct Udebug_TimedObjectiveComponent_C_Get_Time_Left_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_TimedObjectiveComponent.debug_TimedObjectiveComponent_C.BndEvt__Addtimebutton_K2Node_ComponentBoundEvent_67_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_TimedObjectiveComponent_C_BndEvt__Addtimebutton_K2Node_ComponentBoundEvent_67_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_TimedObjectiveComponent.debug_TimedObjectiveComponent_C.BndEvt__Settimeleftminutesbutton_K2Node_ComponentBoundEvent_92_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_TimedObjectiveComponent_C_BndEvt__Settimeleftminutesbutton_K2Node_ComponentBoundEvent_92_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_TimedObjectiveComponent.debug_TimedObjectiveComponent_C.ExecuteUbergraph_debug_TimedObjectiveComponent
	 */
	struct Udebug_TimedObjectiveComponent_C_ExecuteUbergraph_debug_TimedObjectiveComponent_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
