#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function debug_Wave.debug_Wave_C.GetText_1
	 */
	struct Udebug_Wave_C_GetText_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_Wave.debug_Wave_C.Get Time Left
	 */
	struct Udebug_Wave_C_Get_Time_Left_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_Wave.debug_Wave_C.Get Num Players
	 */
	struct Udebug_Wave_C_Get_Num_Players_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_Wave.debug_Wave_C.GetWaveName
	 */
	struct Udebug_Wave_C_GetWaveName_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_Wave.debug_Wave_C.Construct
	 */
	struct Udebug_Wave_C_Construct_Params
	{
	};

	/**
	 * Function debug_Wave.debug_Wave_C.ExecuteUbergraph_debug_Wave
	 */
	struct Udebug_Wave_C_ExecuteUbergraph_debug_Wave_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
