#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function debugmenu_MapList.debugmenu_MapList_C.PreConstruct
	 */
	struct Udebugmenu_MapList_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function debugmenu_MapList.debugmenu_MapList_C.Construct
	 */
	struct Udebugmenu_MapList_C_Construct_Params
	{
	};

	/**
	 * Function debugmenu_MapList.debugmenu_MapList_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_77_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebugmenu_MapList_C_BndEvt__Button_1_K2Node_ComponentBoundEvent_77_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debugmenu_MapList.debugmenu_MapList_C.MapListButtonClicked_Event_1
	 */
	struct Udebugmenu_MapList_C_MapListButtonClicked_Event_1_Params
	{
	public:
		class FText                                                MapListString;                                           // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

	/**
	 * Function debugmenu_MapList.debugmenu_MapList_C.SetMapList
	 */
	struct Udebugmenu_MapList_C_SetMapList_Params
	{
	public:
		TArray<class FString>                                      InMapList;                                               // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)

	};

	/**
	 * Function debugmenu_MapList.debugmenu_MapList_C.ExecuteUbergraph_debugmenu_MapList
	 */
	struct Udebugmenu_MapList_C_ExecuteUbergraph_debugmenu_MapList_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function debugmenu_MapList.debugmenu_MapList_C.MapListClicked__DelegateSignature
	 */
	struct Udebugmenu_MapList_C_MapListClicked__DelegateSignature_Params
	{
	public:
		class FText                                                MapName;                                                 // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
