#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function debug_TicketsComponent.debug_TicketsComponent_C.red tix
	 */
	struct Udebug_TicketsComponent_C_red_tix_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_TicketsComponent.debug_TicketsComponent_C.blue tix
	 */
	struct Udebug_TicketsComponent_C_blue_tix_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_TicketsComponent.debug_TicketsComponent_C.Initial Tickets
	 */
	struct Udebug_TicketsComponent_C_Initial_Tickets_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function debug_TicketsComponent.debug_TicketsComponent_C.BndEvt__BlueSet_K2Node_ComponentBoundEvent_82_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_TicketsComponent_C_BndEvt__BlueSet_K2Node_ComponentBoundEvent_82_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_TicketsComponent.debug_TicketsComponent_C.BndEvt__RedSet_K2Node_ComponentBoundEvent_128_OnButtonClickedEvent__DelegateSignature
	 */
	struct Udebug_TicketsComponent_C_BndEvt__RedSet_K2Node_ComponentBoundEvent_128_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function debug_TicketsComponent.debug_TicketsComponent_C.SetOwner
	 */
	struct Udebug_TicketsComponent_C_SetOwner_Params
	{
	public:
		class UObject*                                             Owner;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function debug_TicketsComponent.debug_TicketsComponent_C.ExecuteUbergraph_debug_TicketsComponent
	 */
	struct Udebug_TicketsComponent_C_ExecuteUbergraph_debug_TicketsComponent_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
