#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature
	 */
	struct UFrontendCapsule_OngoingEvent_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature_Params
	{
	};

	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.PreConstruct
	 */
	struct UFrontendCapsule_OngoingEvent_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_85_OnButtonClickedEvent__DelegateSignature
	 */
	struct UFrontendCapsule_OngoingEvent_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_85_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	 */
	struct UFrontendCapsule_OngoingEvent_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct UFrontendCapsule_OngoingEvent_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.Setup
	 */
	struct UFrontendCapsule_OngoingEvent_C_Setup_Params
	{
	public:
		class FText                                                Title;                                                   // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
		class FText                                                Description;                                             // 0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
		class UTexture2D*                                          Image;                                                   // 0x0030(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.ExecuteUbergraph_FrontendCapsule_OngoingEvent
	 */
	struct UFrontendCapsule_OngoingEvent_C_ExecuteUbergraph_FrontendCapsule_OngoingEvent_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function FrontendCapsule_OngoingEvent.FrontendCapsule_OngoingEvent_C.OnClick__DelegateSignature
	 */
	struct UFrontendCapsule_OngoingEvent_C_OnClick__DelegateSignature_Params
	{
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
