#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function InventoryEntry.InventoryEntry_C.SetSelected
	 */
	struct UInventoryEntry_C_SetSelected_Params
	{
	public:
		bool                                                       _;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.Construct
	 */
	struct UInventoryEntry_C_Construct_Params
	{
	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.UpdateInventoryItem
	 */
	struct UInventoryEntry_C_UpdateInventoryItem_Params
	{
	public:
		class AInventoryItem*                                      InventoryItem;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.UpdateEquippedState
	 */
	struct UInventoryEntry_C_UpdateEquippedState_Params
	{
	public:
		bool                                                       IsEquipped;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsToBeEquipped;                                          // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsUnequipped;                                            // 0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AInventoryItem*                                      Shield;                                                  // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.Tick
	 */
	struct UInventoryEntry_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.ToggleShieldEquipped
	 */
	struct UInventoryEntry_C_ToggleShieldEquipped_Params
	{
	public:
		bool                                                       _;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AInventoryItem*                                      Shield;                                                  // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.On Key Bind Changed
	 */
	struct UInventoryEntry_C_On_Key_Bind_Changed_Params
	{
	public:
		class FName                                                ActionName;                                              // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.UpdateHasShield
	 */
	struct UInventoryEntry_C_UpdateHasShield_Params
	{
	public:
		class AInventoryItem*                                      Shield;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.SetSelectedState
	 */
	struct UInventoryEntry_C_SetSelectedState_Params
	{
	public:
		bool                                                       Selected;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.SetItemValid
	 */
	struct UInventoryEntry_C_SetItemValid_Params
	{
	public:
		bool                                                       IsValid;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.SetItemVisible
	 */
	struct UInventoryEntry_C_SetItemVisible_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function InventoryEntry.InventoryEntry_C.ExecuteUbergraph_InventoryEntry
	 */
	struct UInventoryEntry_C_ExecuteUbergraph_InventoryEntry_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
