#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MapListButton.MapListButton_C.OnMouseButtonDown_1
	 */
	struct UMapListButton_C_OnMouseButtonDown_1_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)

	};

	/**
	 * Function MapListButton.MapListButton_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1300_OnButtonHoverEvent__DelegateSignature
	 */
	struct UMapListButton_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_1300_OnButtonHoverEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function MapListButton.MapListButton_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_852_OnButtonClickedEvent__DelegateSignature
	 */
	struct UMapListButton_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_852_OnButtonClickedEvent__DelegateSignature_Params
	{
	};

	/**
	 * Function MapListButton.MapListButton_C.Construct
	 */
	struct UMapListButton_C_Construct_Params
	{
	};

	/**
	 * Function MapListButton.MapListButton_C.PreConstruct
	 */
	struct UMapListButton_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function MapListButton.MapListButton_C.ExecuteUbergraph_MapListButton
	 */
	struct UMapListButton_C_ExecuteUbergraph_MapListButton_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function MapListButton.MapListButton_C.MapListButtonClicked__DelegateSignature
	 */
	struct UMapListButton_C_MapListButtonClicked__DelegateSignature_Params
	{
	public:
		class FText                                                MapListString;                                           // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
