#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.BndEvt__OptionsButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	 */
	struct UMatchOverviewSelectScreen_C_BndEvt__OptionsButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.BndEvt__Credits_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	 */
	struct UMatchOverviewSelectScreen_C_BndEvt__Credits_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.OnInitialized
	 */
	struct UMatchOverviewSelectScreen_C_OnInitialized_Params
	{
	};

	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.OnOpenedScreen
	 */
	struct UMatchOverviewSelectScreen_C_OnOpenedScreen_Params
	{
	};

	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.BndEvt__PlayerlistButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	 */
	struct UMatchOverviewSelectScreen_C_BndEvt__PlayerlistButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.FocusGamepad
	 */
	struct UMatchOverviewSelectScreen_C_FocusGamepad_Params
	{
	};

	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.OnGamepadInputModeChanged_Event_1
	 */
	struct UMatchOverviewSelectScreen_C_OnGamepadInputModeChanged_Event_1_Params
	{
	public:
		TBL_EGamepadInputMode                                      GamepadInputMode;                                        // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function MatchOverviewSelectScreen.MatchOverviewSelectScreen_C.ExecuteUbergraph_MatchOverviewSelectScreen
	 */
	struct UMatchOverviewSelectScreen_C_ExecuteUbergraph_MatchOverviewSelectScreen_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
