#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.PreConstruct
	 */
	struct UMaterialProgressBar_Circular_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.Construct
	 */
	struct UMaterialProgressBar_Circular_C_Construct_Params
	{
	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.UpdateProgress
	 */
	struct UMaterialProgressBar_Circular_C_UpdateProgress_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.UpdateKeybind
	 */
	struct UMaterialProgressBar_Circular_C_UpdateKeybind_Params
	{
	public:
		class FString                                              KeyBind;                                                 // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)

	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.UpdateKeybindVisibility
	 */
	struct UMaterialProgressBar_Circular_C_UpdateKeybindVisibility_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.UpdateBackgroundFillVisibility
	 */
	struct UMaterialProgressBar_Circular_C_UpdateBackgroundFillVisibility_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.UpdateBackgroundVisibility
	 */
	struct UMaterialProgressBar_Circular_C_UpdateBackgroundVisibility_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.UpdateProgressBarVisibility
	 */
	struct UMaterialProgressBar_Circular_C_UpdateProgressBarVisibility_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function MaterialProgressBar_Circular.MaterialProgressBar_Circular_C.ExecuteUbergraph_MaterialProgressBar_Circular
	 */
	struct UMaterialProgressBar_Circular_C_ExecuteUbergraph_MaterialProgressBar_Circular_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
