#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function OptionsSpinBox.OptionsSpinBox_C.BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature
	 */
	struct UOptionsSpinBox_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)

	};

	/**
	 * Function OptionsSpinBox.OptionsSpinBox_C.BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_34_OnEditableTextBoxCommittedEvent__DelegateSignature
	 */
	struct UOptionsSpinBox_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_34_OnEditableTextBoxCommittedEvent__DelegateSignature_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		SlateCore_ETextCommit                                      CommitMethod;                                            // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function OptionsSpinBox.OptionsSpinBox_C.SetText
	 */
	struct UOptionsSpinBox_C_SetText_Params
	{
	public:
		class FText                                                InText;                                                  // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

	/**
	 * Function OptionsSpinBox.OptionsSpinBox_C.ExecuteUbergraph_OptionsSpinBox
	 */
	struct UOptionsSpinBox_C_ExecuteUbergraph_OptionsSpinBox_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function OptionsSpinBox.OptionsSpinBox_C.OnTextCommitted__DelegateSignature
	 */
	struct UOptionsSpinBox_C_OnTextCommitted__DelegateSignature_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
