#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.HandleReject
	 */
	struct UPartyInviteNotificationWidget_C_HandleReject_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.Fade Out
	 */
	struct UPartyInviteNotificationWidget_C_Fade_Out_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.EnableInputs
	 */
	struct UPartyInviteNotificationWidget_C_EnableInputs_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.DisableInputs
	 */
	struct UPartyInviteNotificationWidget_C_DisableInputs_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.Accept Key pressed
	 */
	struct UPartyInviteNotificationWidget_C_Accept_Key_pressed_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.Reject Input Pressed
	 */
	struct UPartyInviteNotificationWidget_C_Reject_Input_Pressed_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.Initialize
	 */
	struct UPartyInviteNotificationWidget_C_Initialize_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.Fade In
	 */
	struct UPartyInviteNotificationWidget_C_Fade_In_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.RemoveWidget
	 */
	struct UPartyInviteNotificationWidget_C_RemoveWidget_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.Handle Accept
	 */
	struct UPartyInviteNotificationWidget_C_Handle_Accept_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.BndEvt__AcceptRadiobutton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	 */
	struct UPartyInviteNotificationWidget_C_BndEvt__AcceptRadiobutton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.BndEvt__RejectRadiobutton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	 */
	struct UPartyInviteNotificationWidget_C_BndEvt__RejectRadiobutton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.PreConstruct
	 */
	struct UPartyInviteNotificationWidget_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.WidgetAnimationEvt_FadeOutAnimation_K2Node_WidgetAnimationEvent_1
	 */
	struct UPartyInviteNotificationWidget_C_WidgetAnimationEvt_FadeOutAnimation_K2Node_WidgetAnimationEvent_1_Params
	{
	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.Cinematic Mode Changed
	 */
	struct UPartyInviteNotificationWidget_C_Cinematic_Mode_Changed_Params
	{
	public:
		CinematicBarsMode_ECinematicBarsMode                       New_mode;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function PartyInviteNotificationWidget.PartyInviteNotificationWidget_C.ExecuteUbergraph_PartyInviteNotificationWidget
	 */
	struct UPartyInviteNotificationWidget_C_ExecuteUbergraph_PartyInviteNotificationWidget_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
