#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__RedditButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__RedditButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__DiscordButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__DiscordButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__RedditButton_K2Node_ComponentBoundEvent_7_OnHovered__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__RedditButton_K2Node_ComponentBoundEvent_7_OnHovered__DelegateSignature_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__TwitterButton_K2Node_ComponentBoundEvent_8_OnHovered__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__TwitterButton_K2Node_ComponentBoundEvent_8_OnHovered__DelegateSignature_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__FacebookButton_K2Node_ComponentBoundEvent_9_OnHovered__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__FacebookButton_K2Node_ComponentBoundEvent_9_OnHovered__DelegateSignature_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__YoutubeButton_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__YoutubeButton_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__WebsiteButton_K2Node_ComponentBoundEvent_11_OnHovered__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__WebsiteButton_K2Node_ComponentBoundEvent_11_OnHovered__DelegateSignature_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.UpdateHoverText
	 */
	struct USocialsLinkBar_C_UpdateHoverText_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
		bool                                                       Clear;                                                   // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.OnMouseLeave
	 */
	struct USocialsLinkBar_C_OnMouseLeave_Params
	{
	public:
		struct FPointerEvent                                       MouseEvent;                                              // 0x0000(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__CloseDevMessage_K2Node_ComponentBoundEvent_12_Clicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__CloseDevMessage_K2Node_ComponentBoundEvent_12_Clicked__DelegateSignature_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.Construct
	 */
	struct USocialsLinkBar_C_Construct_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__DiscordButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__DiscordButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__WebsiteButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__WebsiteButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.OnMotdUpdated
	 */
	struct USocialsLinkBar_C_OnMotdUpdated_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.UpdateMotd
	 */
	struct USocialsLinkBar_C_UpdateMotd_Params
	{
	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__DevMsgLinkButton_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__DevMsgLinkButton_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__YoutubeButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__YoutubeButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__FacebookButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__FacebookButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.BndEvt__TwitterButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	 */
	struct USocialsLinkBar_C_BndEvt__TwitterButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature_Params
	{
	public:
		class UStatefulButton_C*                                   Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.AttemptOpenURL
	 */
	struct USocialsLinkBar_C_AttemptOpenURL_Params
	{
	public:
		class FString                                              URL;                                                     // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)

	};

	/**
	 * Function SocialsLinkBar.SocialsLinkBar_C.ExecuteUbergraph_SocialsLinkBar
	 */
	struct USocialsLinkBar_C_ExecuteUbergraph_SocialsLinkBar_Params
	{
	public:
		int                                                        EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
