#pragma once

/**
 * Name: chiv2
 * Version: 123456
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function TBL.UtilityAI_Action.TickAction
	 */
	struct UUtilityAI_Action_TickAction_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FUtilityAI_Context                                  C;                                                       // 0x0008(0x0030)  (Parm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.UtilityAI_Action.ShouldRestartIfRedecidedUpon
	 */
	struct UUtilityAI_Action_ShouldRestartIfRedecidedUpon_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.UtilityAI_Action.SetCanInterrupt
	 */
	struct UUtilityAI_Action_SetCanInterrupt_Params
	{
	public:
		bool                                                       bInCanInterrupt;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.UtilityAI_Action.PerformAction
	 */
	struct UUtilityAI_Action_PerformAction_Params
	{
	public:
		struct FUtilityAI_Context                                  C;                                                       // 0x0000(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.UtilityAI_Action.MarkReadyToFinish
	 */
	struct UUtilityAI_Action_MarkReadyToFinish_Params
	{
	};

	/**
	 * Function TBL.UtilityAI_Action.MarkFinished
	 */
	struct UUtilityAI_Action_MarkFinished_Params
	{
	};

	/**
	 * Function TBL.UtilityAI_Action.IsInProgress
	 */
	struct UUtilityAI_Action_IsInProgress_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.UtilityAI_Action.IsDoneOrCanInterrupt
	 */
	struct UUtilityAI_Action_IsDoneOrCanInterrupt_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.UtilityAI_Action.CompleteAction
	 */
	struct UUtilityAI_Action_CompleteAction_Params
	{
	public:
		struct FUtilityAI_Context                                  C;                                                       // 0x0000(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.A_DismountSiegeEngine.Dismount
	 */
	struct UA_DismountSiegeEngine_Dismount_Params
	{
	public:
		struct FAIDismountData                                     AIDismountData;                                          // 0x0000(0x0010)  (Parm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.A_UseBatteringRam.StopCharging
	 */
	struct UA_UseBatteringRam_StopCharging_Params
	{
	};

	/**
	 * Function TBL.A_UseBatteringRam.StartCharging
	 */
	struct UA_UseBatteringRam_StartCharging_Params
	{
	};

	/**
	 * Function TBL.A_UseBatteringRam.OnDismount
	 */
	struct UA_UseBatteringRam_OnDismount_Params
	{
	public:
		class ATBLCharacter*                                       Driver;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TBL_EDismountType                                          DismountType;                                            // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.A_UseBatteringRam.OnChargeUpdated
	 */
	struct UA_UseBatteringRam_OnChargeUpdated_Params
	{
	public:
		class ABatteringRam*                                       InBatteringRam;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Charge;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.A_UseCharacterMountableActor.StopCharging
	 */
	struct UA_UseCharacterMountableActor_StopCharging_Params
	{
	};

	/**
	 * Function TBL.A_UseCharacterMountableActor.StartCharging
	 */
	struct UA_UseCharacterMountableActor_StartCharging_Params
	{
	};

	/**
	 * Function TBL.A_UseCharacterMountableActor.OnDismount
	 */
	struct UA_UseCharacterMountableActor_OnDismount_Params
	{
	public:
		class ATBLCharacter*                                       Driver;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TBL_EDismountType                                          DismountType;                                            // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.A_UseCharacterMountableActor.OnChargeUpdated
	 */
	struct UA_UseCharacterMountableActor_OnChargeUpdated_Params
	{
	public:
		class ACharacterMountableActor*                            InCharacterMountableActor;                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Charge;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.TerminateAbility
	 */
	struct UAbilitiesComponent_TerminateAbility_Params
	{
	public:
		class UAbilitySpec*                                        Spec;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FResult                                             ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.SyncServerInitiateAbility
	 */
	struct UAbilitiesComponent_SyncServerInitiateAbility_Params
	{
	public:
		struct FServerInitiateAbilityParams                        Params;                                                  // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.ServerTerminateAbility
	 */
	struct UAbilitiesComponent_ServerTerminateAbility_Params
	{
	public:
		class UAbilitySpec*                                        AbilitySpec;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.ServerInitiateAbility
	 */
	struct UAbilitiesComponent_ServerInitiateAbility_Params
	{
	public:
		struct FServerInitiateAbilityParams                        Params;                                                  // 0x0000(0x0018)  (ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.ServerCombatStateStartAttack
	 */
	struct UAbilitiesComponent_ServerCombatStateStartAttack_Params
	{
	public:
		class UAbilitySpec*                                        AbilitySpec;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FCombatStateStartAttack                             Params;                                                  // 0x0008(0x0038)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.RemoveInvocationActor
	 */
	struct UAbilitiesComponent_RemoveInvocationActor_Params
	{
	public:
		class UAbilitySpec*                                        AbilitySpec;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TBL_EInvocationScope                                       Scope;                                                   // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Actor;                                                   // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.OnInvocationComplete
	 */
	struct UAbilitiesComponent_OnInvocationComplete_Params
	{
	public:
		class AAbilityInvocation*                                  Invocation;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAbilitySpec*                                        AbilitySpec;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.InitiateAbility
	 */
	struct UAbilitiesComponent_InitiateAbility_Params
	{
	public:
		class UAbilitySpec*                                        Spec;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAbilityInitiationParams                            InitiationParams;                                        // 0x0008(0x0038)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		struct FResult                                             ReturnValue;                                             // 0x0040(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.GetAbility
	 */
	struct UAbilitiesComponent_GetAbility_Params
	{
	public:
		class UAbilitySpec*                                        Spec;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAbility                                            ReturnValue;                                             // 0x0008(0x0048)  (Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.ClientStartTargetMethodCosmetic
	 */
	struct UAbilitiesComponent_ClientStartTargetMethodCosmetic_Params
	{
	public:
		class UAbilitySpec*                                        AbilitySpec;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int                                                        InvocationId;                                            // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAbilityInitiationParams                            InitiationParams;                                        // 0x0010(0x0038)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		class UAbilityTargetMethod*                                TargetMethod;                                            // 0x0048(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.ClientSpamTest
	 */
	struct UAbilitiesComponent_ClientSpamTest_Params
	{
	public:
		class FString                                              Payload;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.ClientAbilityInvocationComplete
	 */
	struct UAbilitiesComponent_ClientAbilityInvocationComplete_Params
	{
	public:
		int                                                        InvocationId;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.ClientAbilityInitiated
	 */
	struct UAbilitiesComponent_ClientAbilityInitiated_Params
	{
	public:
		struct FClientAbilityInitiationParams                      Params;                                                  // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitiesComponent.CanInitiate
	 */
	struct UAbilitiesComponent_CanInitiate_Params
	{
	public:
		class UAbilitySpec*                                        Spec;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FResult                                             ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityConfig.GetAnimationMontageSection
	 */
	struct UAbilityConfig_GetAnimationMontageSection_Params
	{
	public:
		class FName                                                AbilityName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityConfig.GetAnimationMontage
	 */
	struct UAbilityConfig_GetAnimationMontage_Params
	{
	public:
		class FName                                                AbilityName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityConfig.GetAbilitySpec
	 */
	struct UAbilityConfig_GetAbilitySpec_Params
	{
	public:
		class FName                                                AbilityName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAbilitySpec*                                        ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityInvocation.Terminate
	 */
	struct AAbilityInvocation_Terminate_Params
	{
	};

	/**
	 * Function TBL.AbilityInvocation.RemoveInvocationActor
	 */
	struct AAbilityInvocation_RemoveInvocationActor_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityInvocation.OnActorDestroyed
	 */
	struct AAbilityInvocation_OnActorDestroyed_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityInvocation.FindInvocationActors
	 */
	struct AAbilityInvocation_FindInvocationActors_Params
	{
	public:
		class FName                                                ActorName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class AActor*>                                      OutActors;                                               // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityInvocation.FindInvocationActor
	 */
	struct AAbilityInvocation_FindInvocationActor_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int                                                        ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityInvocation.AddInvocationActor
	 */
	struct AAbilityInvocation_AddInvocationActor_Params
	{
	public:
		class FName                                                ActorName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Actor;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityInvocationRegistryComponent.ClientTargetMethodEvent
	 */
	struct UAbilityInvocationRegistryComponent_ClientTargetMethodEvent_Params
	{
	public:
		int                                                        InvocationId;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TargetMethodName;                                        // 0x0004(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TBL_ETargetMethodEvent                                     Event;                                                   // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             Location;                                                // 0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class AActor*>                                      HitTargets;                                              // 0x0020(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityInvocationRegistryComponent.ClientAbilityError
	 */
	struct UAbilityInvocationRegistryComponent_ClientAbilityError_Params
	{
	public:
		int                                                        InvocationId;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FResult                                             Error;                                                   // 0x0008(0x0010)  (Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilitySpec.GetAllChildActions
	 */
	struct UAbilitySpec_GetAllChildActions_Params
	{
	public:
		TArray<class UAction*>                                     outActions;                                              // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityTargetMethod.StartCosmetic
	 */
	struct UAbilityTargetMethod_StartCosmetic_Params
	{
	};

	/**
	 * Function TBL.AbilityTargetMethod.StartAutonomous
	 */
	struct UAbilityTargetMethod_StartAutonomous_Params
	{
	};

	/**
	 * Function TBL.AbilityTargetMethod.Start
	 */
	struct UAbilityTargetMethod_Start_Params
	{
	};

	/**
	 * Function TBL.AbilityTargetMethod.GetInvocation
	 */
	struct UAbilityTargetMethod_GetInvocation_Params
	{
	public:
		class AAbilityInvocation*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityTargetMethod.GetContextString
	 */
	struct UAbilityTargetMethod_GetContextString_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityTargetMethod.Finish
	 */
	struct UAbilityTargetMethod_Finish_Params
	{
	};

	/**
	 * Function TBL.AbilityTargetMethod.ClampTargetLocationToGround
	 */
	struct UAbilityTargetMethod_ClampTargetLocationToGround_Params
	{
	public:
		class AActor*                                              InInitiator;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             TargetLocation;                                          // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MaxRange;                                                // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bHitGround;                                              // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bTraceComplex;                                           // 0x0019(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MaxGroundTraceZAllowance;                                // 0x001C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             ReturnValue;                                             // 0x0020(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityTargetMethod.CanInitiate
	 */
	struct UAbilityTargetMethod_CanInitiate_Params
	{
	public:
		struct FResult                                             ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AbilityTargetMethod.Cancel
	 */
	struct UAbilityTargetMethod_Cancel_Params
	{
	};

	/**
	 * Function TBL.Achievement.GetTrackedObjectName
	 */
	struct UAchievement_GetTrackedObjectName_Params
	{
	public:
		class APlayerState*                                        InPlayerState;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAchievementProgress                                InAchievement;                                           // 0x0008(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FText                                                ReturnValue;                                             // 0x0040(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AchievementsList.UpdateProcessedItems
	 */
	struct UAchievementsList_UpdateProcessedItems_Params
	{
	};

	/**
	 * DelegateFunction TBL.AchievementsList.OnSortAchievement__DelegateSignature
	 */
	struct UAchievementsList_OnSortAchievement__DelegateSignature_Params
	{
	public:
		struct FAchievementProgress                                A;                                                       // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FAchievementProgress                                B;                                                       // 0x0038(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0070(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * DelegateFunction TBL.AchievementsList.OnGenerateAchievement__DelegateSignature
	 */
	struct UAchievementsList_OnGenerateAchievement__DelegateSignature_Params
	{
	public:
		struct FAchievementProgress                                Achievement;                                             // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class UWidget*                                             ReturnValue;                                             // 0x0038(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * DelegateFunction TBL.AchievementsList.OnFilterAchievement__DelegateSignature
	 */
	struct UAchievementsList_OnFilterAchievement__DelegateSignature_Params
	{
	public:
		struct FAchievementProgress                                Achievement;                                             // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0038(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AchievementsList.Initialize
	 */
	struct UAchievementsList_Initialize_Params
	{
	public:
		class ATBLPlayerState*                                     InPlayerState;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AchievementsList.GetProcessedItemsCount
	 */
	struct UAchievementsList_GetProcessedItemsCount_Params
	{
	public:
		int                                                        ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AchievementsList.GetProcessedItemAt
	 */
	struct UAchievementsList_GetProcessedItemAt_Params
	{
	public:
		int                                                        Index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAchievementProgress                                ReturnValue;                                             // 0x0008(0x0038)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.UpdateSprint
	 */
	struct UAIControlHandler_UpdateSprint_Params
	{
	};

	/**
	 * Function TBL.AIControlHandler.UpdateAction
	 */
	struct UAIControlHandler_UpdateAction_Params
	{
	};

	/**
	 * Function TBL.AIControlHandler.StopAction
	 */
	struct UAIControlHandler_StopAction_Params
	{
	public:
		TBL_EWeaponAbilitySlotKey                                  Action;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.StartAction
	 */
	struct UAIControlHandler_StartAction_Params
	{
	public:
		TBL_EWeaponAbilitySlotKey                                  Action;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.RevokeSprint
	 */
	struct UAIControlHandler_RevokeSprint_Params
	{
	public:
		class UObject*                                             RequestedBy;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.RevokeAllActionsFromObject
	 */
	struct UAIControlHandler_RevokeAllActionsFromObject_Params
	{
	public:
		class UObject*                                             RequestedBy;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.RevokeAction
	 */
	struct UAIControlHandler_RevokeAction_Params
	{
	public:
		TBL_EWeaponAbilitySlotKey                                  Action;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UObject*                                             RequestedBy;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TBL_EInputPriority                                         Priority;                                                // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0011(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.RequestSprint
	 */
	struct UAIControlHandler_RequestSprint_Params
	{
	public:
		class UObject*                                             RequestedBy;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.RequestAction
	 */
	struct UAIControlHandler_RequestAction_Params
	{
	public:
		TBL_EWeaponAbilitySlotKey                                  Action;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UObject*                                             RequestedBy;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TBL_EInputPriority                                         Priority;                                                // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0011(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.OnPossess
	 */
	struct UAIControlHandler_OnPossess_Params
	{
	public:
		class APawn*                                               Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.Initialize
	 */
	struct UAIControlHandler_Initialize_Params
	{
	};

	/**
	 * Function TBL.AIControlHandler.GetWeaponAbilitySlotKey
	 */
	struct UAIControlHandler_GetWeaponAbilitySlotKey_Params
	{
	public:
		class FName                                                Name;                                                    // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TBL_EWeaponAbilitySlotKey                                  ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AIControlHandler.ClearSprint
	 */
	struct UAIControlHandler_ClearSprint_Params
	{
	};

	/**
	 * Function TBL.AIControlHandler.ClearActions
	 */
	struct UAIControlHandler_ClearActions_Params
	{
	};

	/**
	 * Function TBL.AINavPoint.K2_GetGoodSprite
	 */
	struct AAINavPoint_K2_GetGoodSprite_Params
	{
	public:
		class UBillboardComponent*                                 ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AINavPoint.K2_GetBadSprite
	 */
	struct AAINavPoint_K2_GetBadSprite_Params
	{
	public:
		class UBillboardComponent*                                 ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AINavPoint.Deactivate
	 */
	struct AAINavPoint_Deactivate_Params
	{
	};

	/**
	 * Function TBL.AINavPoint.Activate
	 */
	struct AAINavPoint_Activate_Params
	{
	};

	/**
	 * Function TBL.TBLPlayerStart.IsValidSpawnFor
	 */
	struct ATBLPlayerStart_IsValidSpawnFor_Params
	{
	public:
		class AController*                                         Controller;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AITagSystem.OnActorKilled
	 */
	struct UAITagSystem_OnActorKilled_Params
	{
	public:
		struct FDeathDamageTakenEvent                              DamageEvent;                                             // 0x0000(0x0160)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AITagSystem.OnActorDestroyed
	 */
	struct UAITagSystem_OnActorDestroyed_Params
	{
	public:
		class AActor*                                              DestroyedActor;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AltWeightsLibrary.UpdateSkinWeightsOverride
	 */
	struct UAltWeightsLibrary_UpdateSkinWeightsOverride_Params
	{
	public:
		class USkinnedMeshComponent*                               InComp;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                InBoneName;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAltWeightsState                                    InOutState;                                              // 0x0010(0x0090)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00A0(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AltWeightsLibrary.SetSkinWeightsOverride
	 */
	struct UAltWeightsLibrary_SetSkinWeightsOverride_Params
	{
	public:
		class USkinnedMeshComponent*                               InComp;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAltWeightsState                                    InState;                                                 // 0x0008(0x0090)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0098(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AltWeightsLibrary.InitSkinWeightsState
	 */
	struct UAltWeightsLibrary_InitSkinWeightsState_Params
	{
	public:
		class USkinnedMeshComponent*                               InComp;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAltWeightsState                                    InState;                                                 // 0x0008(0x0090)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0098(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AltWeightsLibrary.InitPawnAltWeightsState
	 */
	struct UAltWeightsLibrary_InitPawnAltWeightsState_Params
	{
	public:
		class ACharacter*                                          Char;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AltWeightsLibrary.ClearAllSkinWeightsOverride
	 */
	struct UAltWeightsLibrary_ClearAllSkinWeightsOverride_Params
	{
	public:
		class USkinnedMeshComponent*                               InComp;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLActor.WakeUpNetDormancyForSeconds
	 */
	struct ATBLActor_WakeUpNetDormancyForSeconds_Params
	{
	public:
		float                                                      Seconds;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLActor.FallBackToSleep
	 */
	struct ATBLActor_FallBackToSleep_Params
	{
	};

	/**
	 * Function TBL.TBLActor.CanBeBaseForCharacterTBL
	 */
	struct ATBLActor_CanBeBaseForCharacterTBL_Params
	{
	public:
		class APawn*                                               Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AlwaysOnMusicManager.SetCurrentMusicState
	 */
	struct AAlwaysOnMusicManager_SetCurrentMusicState_Params
	{
	public:
		TBL_EAlwaysOnMusicState                                    NewState;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AlwaysOnMusicManager.OnRep_AlwaysOnMusicState
	 */
	struct AAlwaysOnMusicManager_OnRep_AlwaysOnMusicState_Params
	{
	};

	/**
	 * Function TBL.AlwaysOnMusicManager.GetCurrentMusicState
	 */
	struct AAlwaysOnMusicManager_GetCurrentMusicState_Params
	{
	public:
		TBL_EAlwaysOnMusicState                                    ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnalyticsUtilitiesLibrary.NotifySocialScreenOpened
	 */
	struct UAnalyticsUtilitiesLibrary_NotifySocialScreenOpened_Params
	{
	};

	/**
	 * Function TBL.AnalyticsUtilitiesLibrary.AnalyticsEventOpenedMenuScreen
	 */
	struct UAnalyticsUtilitiesLibrary_AnalyticsEventOpenedMenuScreen_Params
	{
	public:
		TBL_EAnalyticsMenuScreen                                   Screen;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnalyticsUtilitiesLibrary.AnalyticsEventDeveloperMessageClickedUrl
	 */
	struct UAnalyticsUtilitiesLibrary_AnalyticsEventDeveloperMessageClickedUrl_Params
	{
	public:
		class FString                                              AccountId;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              URL;                                                     // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnalyticsUtilitiesLibrary.AnalyticsEventClosedMenuScreen
	 */
	struct UAnalyticsUtilitiesLibrary_AnalyticsEventClosedMenuScreen_Params
	{
	public:
		TBL_EAnalyticsMenuScreen                                   Screen;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetVectorF
	 */
	struct UAnimatableImage_SetVectorF_Params
	{
	public:
		struct FLinearColor                                        InVectorF;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetVectorE
	 */
	struct UAnimatableImage_SetVectorE_Params
	{
	public:
		struct FLinearColor                                        InVectorE;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetVectorD
	 */
	struct UAnimatableImage_SetVectorD_Params
	{
	public:
		struct FLinearColor                                        InVectorD;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetVectorC
	 */
	struct UAnimatableImage_SetVectorC_Params
	{
	public:
		struct FLinearColor                                        InVectorC;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetVectorB
	 */
	struct UAnimatableImage_SetVectorB_Params
	{
	public:
		struct FLinearColor                                        InVectorA;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetVectorA
	 */
	struct UAnimatableImage_SetVectorA_Params
	{
	public:
		struct FLinearColor                                        InVectorA;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetFloatF
	 */
	struct UAnimatableImage_SetFloatF_Params
	{
	public:
		float                                                      InFloatF;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetFloatE
	 */
	struct UAnimatableImage_SetFloatE_Params
	{
	public:
		float                                                      InFloatE;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetFloatD
	 */
	struct UAnimatableImage_SetFloatD_Params
	{
	public:
		float                                                      InFloatD;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetFloatC
	 */
	struct UAnimatableImage_SetFloatC_Params
	{
	public:
		float                                                      InFloatC;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetFloatB
	 */
	struct UAnimatableImage_SetFloatB_Params
	{
	public:
		float                                                      InFloatB;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatableImage.SetFloatA
	 */
	struct UAnimatableImage_SetFloatA_Params
	{
	public:
		float                                                      InFloatA;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * DelegateFunction TBL.AnimatableImage.OverrideMaterial__DelegateSignature
	 */
	struct UAnimatableImage_OverrideMaterial__DelegateSignature_Params
	{
	public:
		class UMaterialInterface*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatingButton.SetColorAndOpacity
	 */
	struct UAnimatingButton_SetColorAndOpacity_Params
	{
	public:
		struct FLinearColor                                        InColorAndOpacity;                                       // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.AnimatingButton.PlayNormalAnimation
	 */
	struct UAnimatingButton_PlayNormalAnimation_Params
	{
	};

	/**
	 * Function TBL.AnimatingButton.GetDynamicMaterial
	 */
	struct UAnimatingButton_GetDynamicMaterial_Params
	{
	public:
		class UMaterialInstanceDynamic*                            ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.ShouldShowLoadoutOnPreparingMatch
	 */
	struct ATBLGameState_ShouldShowLoadoutOnPreparingMatch_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.ShouldShowLoadoutOnFirstDeath
	 */
	struct ATBLGameState_ShouldShowLoadoutOnFirstDeath_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.SetStageTimeRemaining
	 */
	struct ATBLGameState_SetStageTimeRemaining_Params
	{
	public:
		float                                                      TimeInSeconds;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.SetStageEndingMusic
	 */
	struct ATBLGameState_SetStageEndingMusic_Params
	{
	public:
		struct FAKAudioStartStopStruct                             Music;                                                   // 0x0000(0x0010)  (Parm, NoDestructor, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.SetObjectiveContextText
	 */
	struct ATBLGameState_SetObjectiveContextText_Params
	{
	public:
		struct FObjectiveContextMessage                            ContextObjectiveMessage;                                 // 0x0000(0x0050)  (Parm, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.SetGameModeType
	 */
	struct ATBLGameState_SetGameModeType_Params
	{
	public:
		TBL_EGameModeType                                          InGameModeType;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.SetCinematicMode
	 */
	struct ATBLGameState_SetCinematicMode_Params
	{
	public:
		TBL_ECinematicGameState                                    State;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ALevelSequenceActor*                                 AgathaSequence;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ALevelSequenceActor*                                 MasonSequence;                                           // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.ResetStagePersistentGameModeMessages
	 */
	struct ATBLGameState_ResetStagePersistentGameModeMessages_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.RemoteStageEndingMusic
	 */
	struct ATBLGameState_RemoteStageEndingMusic_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.PlayerKilled
	 */
	struct ATBLGameState_PlayerKilled_Params
	{
	public:
		class AController*                                         Killer;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AController*                                         Killed;                                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UDamageSource*                                       DamageSource;                                            // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FDeathEvent                                         DeathEvent;                                              // 0x0018(0x0040)  (Parm, NativeAccessSpecifierPublic)
		struct FDeathDamageTakenEvent                              DamageEvent;                                             // 0x0058(0x0160)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.PlayCinematicsWithBinding
	 */
	struct ATBLGameState_PlayCinematicsWithBinding_Params
	{
	public:
		class ALevelSequenceActor*                                 AgathaSequence;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ALevelSequenceActor*                                 MasonSequence;                                           // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TMap<class ASpawner*, class FString>                       InSpawnerPrefixes;                                       // 0x0010(0x0050)  (Parm, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.OnRep_Victor
	 */
	struct ATBLGameState_OnRep_Victor_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_StageEndingMusic
	 */
	struct ATBLGameState_OnRep_StageEndingMusic_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_SequenceBindings
	 */
	struct ATBLGameState_OnRep_SequenceBindings_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_PS5MatchResponsiblePlayer
	 */
	struct ATBLGameState_OnRep_PS5MatchResponsiblePlayer_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_PS5MatchId
	 */
	struct ATBLGameState_OnRep_PS5MatchId_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_PostMatchEndTime
	 */
	struct ATBLGameState_OnRep_PostMatchEndTime_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_GameModeType
	 */
	struct ATBLGameState_OnRep_GameModeType_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_FactionContextObjectiveMessage
	 */
	struct ATBLGameState_OnRep_FactionContextObjectiveMessage_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_ClassLimits
	 */
	struct ATBLGameState_OnRep_ClassLimits_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.OnRep_CinematicState
	 */
	struct ATBLGameState_OnRep_CinematicState_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.NotifyCinematicStartedPlayingTryBinding
	 */
	struct ATBLGameState_NotifyCinematicStartedPlayingTryBinding_Params
	{
	};

	/**
	 * Function TBL.TBLGameState.IsWaitingForMinPlayersToStart
	 */
	struct ATBLGameState_IsWaitingForMinPlayersToStart_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.IsWaitingForAdminToStart
	 */
	struct ATBLGameState_IsWaitingForAdminToStart_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.IsServerBadFrameTime
	 */
	struct ATBLGameState_IsServerBadFrameTime_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.IsPostMatch
	 */
	struct ATBLGameState_IsPostMatch_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	};

	/**
	 * Function TBL.TBLGameState.IsMatchWaitingToStart
	 */
	struct ATBLGameState_IsMatchWaitingToStart_Params
	{
	public:
